In [18]:
import sys
sys.path.append('../')

In [19]:
import numpy as np
import pandas as pd
import math
from data_split import k_fold_split, k_fold_n_splits

In [20]:
df = pd.read_excel("../data/2-PreferenciasBritanicos(TP1).xlsx")
df

    scones  cerveza  wiskey  avena  futbol Nacionalidad
0        0        0       1      1       1            I
1        1        0       1      1       0            I
2        1        1       0      0       1            I
3        1        1       0      0       0            I
4        0        1       0      0       1            I
5        0        0       0      1       0            I
6        1        0       0      1       1            E
7        1        1       0      0       1            E
8        1        1       1      1       0            E
9        1        1       0      1       0            E
10       1        1       0      1       1            E
11       1        0       1      1       0            E
12       1        0       1      0       0            E

In [21]:
random_generator = np.random.default_rng(seed=42)

In [22]:
k = 3

In [23]:
test_size = df.shape[0] / k
(test_size * (k-1), test_size)

(8.666666666666666, 4.333333333333333)

In [24]:
train_df, test_df = k_fold_split(df, k, random_generator)

In [25]:
train_df

   scones cerveza wiskey avena futbol Nacionalidad
8       1       1      1     1      0            E
11      1       0      1     1      0            E
5       0       0      0     1      0            I
10      1       1      0     1      1            E
9       1       1      0     1      0            E
3       1       1      0     0      0            I
6       1       0      0     1      1            E
1       1       0      1     1      0            I
7       1       1      0     0      1            E

In [26]:
test_df

   scones cerveza wiskey avena futbol Nacionalidad
0       0       0      1     1      1            I
2       1       1      0     0      1            I
4       0       1      0     0      1            I
12      1       0      1     0      0            E

In [27]:
n = 3

In [28]:
[(train_df_1, test_df_1), (train_df_2, test_df_2), (train_df_3, test_df_3)] = k_fold_n_splits(df, k, n, random_generator)

In [29]:
train_df_1

   scones cerveza wiskey avena futbol Nacionalidad
7       1       1      0     0      1            E
9       1       1      0     1      0            E
2       1       1      0     0      1            I
1       1       0      1     1      0            I
10      1       1      0     1      1            E
8       1       1      1     1      0            E
0       0       0      1     1      1            I
12      1       0      1     0      0            E
3       1       1      0     0      0            I

In [30]:
train_df_2

   scones cerveza wiskey avena futbol Nacionalidad
7       1       1      0     0      1            E
9       1       1      0     1      0            E
2       1       1      0     0      1            I
1       1       0      1     1      0            I
10      1       1      0     1      1            E
11      1       0      1     1      0            E
4       0       1      0     0      1            I
5       0       0      0     1      0            I
6       1       0      0     1      1            E

In [31]:
train_df_3

   scones cerveza wiskey avena futbol Nacionalidad
11      1       0      1     1      0            E
4       0       1      0     0      1            I
5       0       0      0     1      0            I
6       1       0      0     1      1            E
8       1       1      1     1      0            E
0       0       0      1     1      1            I
12      1       0      1     0      0            E
3       1       1      0     0      0            I

In [32]:
test_df_1

   scones cerveza wiskey avena futbol Nacionalidad
11      1       0      1     1      0            E
4       0       1      0     0      1            I
5       0       0      0     1      0            I
6       1       0      0     1      1            E

In [33]:
test_df_2

   scones cerveza wiskey avena futbol Nacionalidad
8       1       1      1     1      0            E
0       0       0      1     1      1            I
12      1       0      1     0      0            E
3       1       1      0     0      0            I

In [34]:
test_df_3

   scones cerveza wiskey avena futbol Nacionalidad
7       1       1      0     0      1            E
9       1       1      0     1      0            E
2       1       1      0     0      1            I
1       1       0      1     1      0            I
10      1       1      0     1      1            E